using System;

// "Властивості та дебагер Visual Studio - дивні речі, які він робить"
namespace _14
{

    /* Дебагер Visual Studio може показувати значення властивостей обєктів у вікні перегляду.
       В результаті при встановленні точки зупинки дебагер буде викликати метод get і показувати
       отримане значення. Це може бути корисно під час пошуку помилок, але також може позначитися 
       на продуктивності. Даний приклад це демонструє. */

    class Program
    {
        // Лічильник, який збільшується при отриманні властивості MyProperty
        public static Int32 Counter { get; set; }

        private static Int32 myVar = 100;
        public static Int32 MyProperty
        {
            get
            {
                System.Diagnostics.Debug.WriteLine($"{DateTime.Now.ToString()}: викликаний метод get властивості MyProperty.");
                ++Counter; // збільшуємо лічильник
                return myVar++; // збільшуємо myVar для демонстрації
            }
        }
        
        static void Main(string[] args)
        {
            /* Ось що тобі потрібно зробити:
               1. Для наступного рядку коду встанови точку зупинки (якщо вона не встановлена);
               2. Запусти цю програму в режимі дебагеру (натисни F5);
               3. Відкрий вікно Output та подивись на останній запис в ньому;
               4. Наведи курсор на MyProperty кілька разів та подивись на вікно Output;
               5. Продовж роботу програми (F5) та подивись на результат. */
            Int32 prop = MyProperty;

            Console.WriteLine($"Стільки разів був викликаний метод get властивості MyProperty: {Counter}");
            Console.ReadLine();



            /* Під час налагодження програми мені подобається наводити курсором на бажаний елемент та бачити
               його значення, це дуже зручно. Але варто звертати увагу й на те, що для властивостей під час
               "наведення курсору" Visual Studio викликає їхній метод get, виконуючи в ньому весь код перед 
               отриманням значення. Visual Studio знає про це та про проблеми, які можуть виникнути та дозволяє
               відключити режим обчислення для властивостей, які відображаються в дебагері. Для цього вибери
               команду Tools->Options, потім в цьому вікні відкрий гілку Debugging->General і скинь позначку
               Enable Property Evaluation And Other Implicit Function Calls. */
        }
    }
}
